# Задание

In [1]:
import pandas as pd

## Task 1

Узнай самый часто встречаемый возраст респондентов

In [2]:
# Код тут
data = pd.read_csv('../datasets/kaggle_survey_2022_responses.csv', low_memory=False)

In [3]:
data.head(3)

,Duration (in seconds),Q2,Q3,Q4,Q5,Q6_1,Q6_2,Q6_3,Q6_4,Q6_5,...,Q44_3,Q44_4,Q44_5,Q44_6,Q44_7,Q44_8,Q44_9,Q44_10,Q44_11,Q44_12
0,Duration (in seconds),What is your age (# years)?,What is your gender? - Selected Choice,In which country do you currently reside?,"Are you currently a student? (high school, uni...",On which platforms have you begun or completed...,On which platforms have you begun or completed...,On which platforms have you begun or completed...,On which platforms have you begun or completed...,On which platforms have you begun or completed...,...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...
1,121,30-34,Man,India,No,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,462,30-34,Man,Algeria,No,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
data.shape

(23998, 296)

In [5]:
data.dtypes

Duration (in seconds)    object
Q2                       object
Q3                       object
Q4                       object
Q5                       object
                          ...
Q44_8                    object
Q44_9                    object
Q44_10                   object
Q44_11                   object
Q44_12                   object
Length: 296, dtype: object

In [6]:
# Строка с возрастом - 'Q2'
# 'Q2' - 'What is your age (# years)?'
data.Q2.value_counts()

Q2
18-21                          4559
25-29                          4472
22-24                          4283
30-34                          2972
35-39                          2353
40-44                          1927
45-49                          1253
50-54                           914
55-59                           611
60-69                           526
70+                             127
What is your age (# years)?       1
Name: count, dtype: int64

In [7]:
print('Самый встречаемый возраст среди респондентов - \033[4m"',
      data.Q2.value_counts().index[0], '"\033[0m\n', sep='' )

Самый встречаемый возраст среди респондентов - "18-21"

## Task 2

Посчитай долю женщин среди русских участников опроса, которые уже не студенты. Результат округли до двух цифр после запятой

In [8]:
# Код тут
# Пол - 'Q3', страна - 'Q4', студент - 'Q5'
# 'Q3' - 'What is your gender? - Selected Choice'
# 'Q4' - 'In which country do you currently reside?'
# 'Q5' - 'Are you currently a student? (high school, university, or graduate)'
woman_data = data[ 
    data['Q4'].str.contains('Russia') &         # из России
    data['Q5'].str.contains('No')               # не студент
    # подсчет вхождений по полу 'Q3', с приведением из % к долям...
    ].Q3.value_counts(normalize=True)['Woman']  # ...и отбор только женщин
print('Доля женщин среди русских участников опроса,'  # печатаем, округляя до 2 знаков
      'которые уже не студенты -', '\033[4m', woman_data.round(2), '\033[0m')

Доля женщин среди русских участников опроса,которые уже не студенты -  0.24

## Task 3

Найди среднее время заполнения опроса в **минутах**. Результат округли до двух знаков после запятой

In [9]:
# Код тут
data.head(3)

,Duration (in seconds),Q2,Q3,Q4,Q5,Q6_1,Q6_2,Q6_3,Q6_4,Q6_5,...,Q44_3,Q44_4,Q44_5,Q44_6,Q44_7,Q44_8,Q44_9,Q44_10,Q44_11,Q44_12
0,Duration (in seconds),What is your age (# years)?,What is your gender? - Selected Choice,In which country do you currently reside?,"Are you currently a student? (high school, uni...",On which platforms have you begun or completed...,On which platforms have you begun or completed...,On which platforms have you begun or completed...,On which platforms have you begun or completed...,On which platforms have you begun or completed...,...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...,Who/what are your favorite media sources that ...
1,121,30-34,Man,India,No,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,462,30-34,Man,Algeria,No,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
# Для приведения типа удалим строку с индексом [0]...
data.drop(0, inplace=True)  # ... в текущем df

In [11]:
data.head(3)

,Duration (in seconds),Q2,Q3,Q4,Q5,Q6_1,Q6_2,Q6_3,Q6_4,Q6_5,...,Q44_3,Q44_4,Q44_5,Q44_6,Q44_7,Q44_8,Q44_9,Q44_10,Q44_11,Q44_12
1,121,30-34,Man,India,No,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,462,30-34,Man,Algeria,No,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,293,18-21,Man,Egypt,Yes,Coursera,edX,NaN,DataCamp,NaN,...,NaN,"Kaggle (notebooks, forums, etc)",NaN,"YouTube (Kaggle YouTube, Cloud AI Adventures, ...","Podcasts (Chai Time Data Science, O’Reilly Dat...",NaN,NaN,NaN,NaN,NaN

In [12]:
# Для подсчета приведем к 'int'...
data['Duration (in seconds)'] = data['Duration (in seconds)'].astype(int)
print('Среднее время заполнения опроса в минутах:', '\033[4m', 
      round(data['Duration (in seconds)'].mean()/60, 2), '\033[0m\n')  # берем среднее и переводим в минуты

Среднее время заполнения опроса в минутах:  168.17

## Task 4

Выведи топ-3 образовательных курса, которые указали респонденты. P.S Это вопрос Q6

In [13]:
# Код тут
# Сформируем список столбцов 'Q6' (образовательные курсы)
q6_col = [col for col in data.columns if col.startswith('Q6')]
print(q6_col)

['Q6_1', 'Q6_2', 'Q6_3', 'Q6_4', 'Q6_5', 'Q6_6', 'Q6_7', 'Q6_8', 'Q6_9', 'Q6_10', 'Q6_11', 'Q6_12']

In [14]:
# Сведем столбцы в один
course = data[q6_col].melt(None, q6_col)
course[:3]

  variable     value
0     Q6_1       NaN
1     Q6_1       NaN
2     Q6_1  Coursera

In [15]:
course['value'].value_counts()[0:3]

value
Coursera                                                 9699
University Courses (resulting in a university degree)    6780
Kaggle Learn Courses                                     6628
Name: count, dtype: int64

In [16]:
print('Топ-3 образовательных курса:\033[4m', 
      *course['value'].value_counts()[0:3].index,
      '\033[0m', sep='\n')

Топ-3 образовательных курса:
Coursera
University Courses (resulting in a university degree)
Kaggle Learn Courses

## Task 5

Узнай топ-5 языков программирования, которые регулярно используют Data Scientists в своей работе

In [17]:
# Код тут
# Сформируем список столбцов 'Q12' (язык программирования)
q12_col = [col for col in data.columns if col.startswith('Q12')]
data_DS = data.query('Q23 =="Data Scientist"')  # отбор по профессии 'Data Scientist'
# Сведём языки программирования в один столбец, и выведем 5 самых используемых
print('Топ-5 языков программирования, которые регулярно используют Data Scientists в своей работе:\033[4m', 
      *data_DS[q12_col].melt(None, q12_col)['value'].value_counts()[:5].index, '\033[0m', sep='\n')

Топ-5 языков программирования, которые регулярно используют Data Scientists в своей работе:
Python
SQL
R
Bash
Javascript

## Task 6

Узнай средний доход среди 'Data Scientist' специалистов и средний доход среди 'Machine Learning/ MLops Engineer' \
Т.к. в колонке Q29 указан промежуток, то возьми среднее значение из промежутка. 

Например: 
- '15,000-19,999' - 17500, 
- '125,000-149,999' - 137500. 
- \> $1,000,000 - оставляем 1000000

Средние доход **округли до целого.**

In [18]:
# Код тут
# Выберем доходы, для создания словаря
data['Q29'].unique()

array([nan, '25,000-29,999', '100,000-124,999', '200,000-249,999',
       '150,000-199,999', '90,000-99,999', '30,000-39,999', '3,000-3,999',
       '50,000-59,999', '125,000-149,999', '15,000-19,999', '5,000-7,499',
       '10,000-14,999', '20,000-24,999', '$0-999', '7,500-9,999',
       '4,000-4,999', '80,000-89,999', '2,000-2,999', '250,000-299,999',
       '1,000-1,999', '$500,000-999,999', '70,000-79,999',
       '60,000-69,999', '40,000-49,999', '>$1,000,000', '300,000-499,999'],
      dtype=object)

In [19]:
# Создадим словарь средних доходов
compensation_map = {'25,000-29,999': 27500, '200,000-249,999': 225000, '150,000-199,999': 175000,
       '50,000-59,999': 55000, '10,000-14,999': 12500, '$0-999': 500, '4,000-4,999': 4500,
       '125,000-149,999': 137500, '3,000-3,999': 3500, '80,000-89,999': 85000, '7,500-9,999': 8750,
       '30,000-39,999': 35000, '100,000-124,999': 112500, '1,000-1,999': 1500, '90,000-99,999': 95000,
       '40,000-49,999': 45000, '15,000-19,999':17500, '70,000-79,999': 75000, '>$1,000,000': 1000000,
       '5,000-7,499': 6250, '2,000-2,999': 2500, '20,000-24,999': 22500, '60,000-69,999': 65000,
       '300,000-499,999': 400000, '250,000-299,999': 275000, '$500,000-999,999': 750000
           }
print(compensation_map)

{'25,000-29,999': 27500, '200,000-249,999': 225000, '150,000-199,999': 175000, '50,000-59,999': 55000, '10,000-14,999': 12500, '$0-999': 500, '4,000-4,999': 4500, '125,000-149,999': 137500, '3,000-3,999': 3500, '80,000-89,999': 85000, '7,500-9,999': 8750, '30,000-39,999': 35000, '100,000-124,999': 112500, '1,000-1,999': 1500, '90,000-99,999': 95000, '40,000-49,999': 45000, '15,000-19,999': 17500, '70,000-79,999': 75000, '>$1,000,000': 1000000, '5,000-7,499': 6250, '2,000-2,999': 2500, '20,000-24,999': 22500, '60,000-69,999': 65000, '300,000-499,999': 400000, '250,000-299,999': 275000, '$500,000-999,999': 750000}

In [20]:
# Другой вариант (автоматический) создания словаря средних доходов
compensation_map2 = {}
for x in data['Q29'].dropna().unique():
    y = x.translate(x.maketrans('','',',$>'))
    if len(y.split('-')) == 1:  # если одно число
        compensation_map2[x] = int(y)
    else:
        i, j = y.split('-')     # если два числа
        compensation_map2[x] = round((int(i) + int(j)) / 2, 0)
        #print(x, y, i, j)
print(compensation_map2)

{'25,000-29,999': 27500.0, '100,000-124,999': 112500.0, '200,000-249,999': 225000.0, '150,000-199,999': 175000.0, '90,000-99,999': 95000.0, '30,000-39,999': 35000.0, '3,000-3,999': 3500.0, '50,000-59,999': 55000.0, '125,000-149,999': 137500.0, '15,000-19,999': 17500.0, '5,000-7,499': 6250.0, '10,000-14,999': 12500.0, '20,000-24,999': 22500.0, '$0-999': 500.0, '7,500-9,999': 8750.0, '4,000-4,999': 4500.0, '80,000-89,999': 85000.0, '2,000-2,999': 2500.0, '250,000-299,999': 275000.0, '1,000-1,999': 1500.0, '$500,000-999,999': 750000.0, '70,000-79,999': 75000.0, '60,000-69,999': 65000.0, '40,000-49,999': 45000.0, '>$1,000,000': 1000000, '300,000-499,999': 400000.0}

In [21]:
# С помощью словаря создадим столбец со средними доходами
data['average_compensation'] = data['Q29'].map(compensation_map2)
data[['Q29', 'average_compensation']]

                 Q29  average_compensation
1                NaN                   NaN
2                NaN                   NaN
3                NaN                   NaN
4      25,000-29,999               27500.0
5                NaN                   NaN
...              ...                   ...
23993            NaN                   NaN
23994            NaN                   NaN
23995  25,000-29,999               27500.0
23996  15,000-19,999               17500.0
23997            NaN                   NaN

[23997 rows x 2 columns]

In [22]:
# Сделаем выборку по профессиям "Data Scientist" и "Machine Learning/ MLops Engineer"
data_DSML = data[['Q23', 'average_compensation']].query('Q23 =="Data Scientist" or Q23 == "Machine Learning/ MLops Engineer"')
data_DSML[:5]

                                 Q23  average_compensation
4                     Data Scientist               27500.0
17                    Data Scientist              225000.0
18                    Data Scientist              175000.0
30                    Data Scientist               55000.0
33  Machine Learning/ MLops Engineer              137500.0

In [23]:
# Вычислим средний доход
data_DSML = data_DSML.groupby(['Q23']).mean().round()
data_DSML

                                  average_compensation
Q23
Data Scientist                                 70337.0
Machine Learning/ MLops Engineer               67438.0

In [24]:
print("Средний доход среди 'Data Scientist':", '\033[4m', 
      *data_DSML.loc['Data Scientist'], '\033[0m',
      "\nСредний доход среди 'Machine Learning/ MLops Engineer':", '\033[4m', 
      *data_DSML.loc['Machine Learning/ MLops Engineer'], '\033[0m')

Средний доход среди 'Data Scientist':  70337.0
Средний доход среди 'Machine Learning/ MLops Engineer':  67438.0

## Дополнительно

Найди какой-нибудь интересный инсайт из этих данных. Пиши свои интересные инсайты в чат проекта с хэштегом.
#инсайт

Автор самого интересного инсайта получит p2p баллы. Поверь, они тебе понадобятся

In [25]:
# Код тут
# Доли мужчин и женщин среди респондентов, всего...
data.Q3.value_counts(normalize=True).head(2)

Q3
Man      0.761178
Woman    0.220278
Name: proportion, dtype: float64

In [26]:
# ... старше 70 лет, в долях
data.query("Q2 == '70+'").Q3.value_counts(normalize=True).head(2)

Q3
Man      0.881890
Woman    0.070866
Name: proportion, dtype: float64

In [27]:
# ... старше 70 лет
data.query("Q2 == '70+'").Q3.value_counts().head(2)

Q3
Man      112
Woman      9
Name: count, dtype: int64

In [28]:
# респонденты из России
data.query("Q4 == 'Russia'").Q3.value_counts()

Q3
Man                        240
Woman                       79
Nonbinary                    3
Prefer to self-describe      1
Prefer not to say            1
Name: count, dtype: int64

In [29]:
# респонденты из России, старше 70
data.query("Q4 == 'Russia' and Q2 == '70+'").Q3

Series([], Name: Q3, dtype: object)

In [30]:
# Среди респондентов из России нет людей старше 70
data.query("Q4 == 'Russia'").Q2.value_counts()

Q2
18-21    77
22-24    62
25-29    54
30-34    52
35-39    30
40-44    20
45-49    15
55-59     6
50-54     6
60-69     2
Name: count, dtype: int64

In [31]:
data.Q2.value_counts()

Q2
18-21    4559
25-29    4472
22-24    4283
30-34    2972
35-39    2353
40-44    1927
45-49    1253
50-54     914
55-59     611
60-69     526
70+       127
Name: count, dtype: int64

In [32]:
data.query("Q4 == 'Russia'").Q30.value_counts()

Q30
$0 ($USD)       51
$1-$99          20
$100-$999       13
$1000-$9,999    12
Name: count, dtype: int64

data.Q30.value_counts()

In [33]:
data.query("Q4 == 'Russia'").Q29.value_counts()

Q29
$0-999             17
10,000-14,999      12
1,000-1,999         8
40,000-49,999       8
7,500-9,999         7
50,000-59,999       5
5,000-7,499         5
25,000-29,999       5
15,000-19,999       5
30,000-39,999       4
20,000-24,999       4
70,000-79,999       3
2,000-2,999         3
60,000-69,999       2
4,000-4,999         1
100,000-124,999     1
90,000-99,999       1
3,000-3,999         1
Name: count, dtype: int64

In [34]:
data[['average_compensation', 'Q4']].query("Q4 == 'Russia'").groupby('average_compensation').count()

                      Q4
average_compensation
500.0                 17
1500.0                 8
2500.0                 3
3500.0                 1
4500.0                 1
6250.0                 5
8750.0                 7
12500.0               12
17500.0                5
22500.0                4
27500.0                5
35000.0                4
45000.0                8
55000.0                5
65000.0                2
75000.0                3
95000.0                1
112500.0               1

In [35]:
data['average_compensation'].value_counts()

average_compensation
500.0        1112
12500.0       493
35000.0       464
1500.0        444
45000.0       421
112500.0      404
6250.0        391
55000.0       366
8750.0        362
175000.0      342
22500.0       337
65000.0       318
17500.0       299
75000.0       289
27500.0       277
2500.0        271
137500.0      269
3500.0        244
4500.0        234
85000.0       222
95000.0       197
225000.0      155
275000.0       78
400000.0       76
750000.0       48
1000000.0      23
Name: count, dtype: int64